---
kind: method
id: M:Autodesk.Revit.DB.ExportFontKey.#ctor(Autodesk.Revit.DB.ExportFontKey)
source: html/30df646b-6951-bbcd-0aa4-40c6f189ea5c.htm
---
# Autodesk.Revit.DB.ExportFontKey.#ctor Method

Constructs a new copy of the input ExportFontKey object.

## Syntax (C#)
```csharp
public ExportFontKey(
	ExportFontKey other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportFontKey`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null